src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequest_SG_MIS_OLD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://cio.att.com/commonheader/v3" xmlns:mod="http://cio.att.com/order/management/model" xmlns:mod1="http://cio.att.com/req/model" xmlns:mod2="http://cio.att.com/entity/model" xmlns:mod3="http://cio.att.com/ord/model">
   <soapenv:Header>
      <v3:WSHeader>
         <v3:WSContext>
            <v3:FromAppId>OCX</v3:FromAppId>
            <v3:ToAppId>OMX</v3:ToAppId>
         </v3:WSContext>
      </v3:WSHeader>
   </soapenv:Header>
   <soapenv:Body>
      <mod:manageOrderRequest>
         <mod:order>
            <mod1:eid>
               <mod2:context>OCX</mod2:context>
               <mod2:id>{$sorId$}</mod2:id>
               <mod2:entityType>SOR</mod2:entityType>
            </mod1:eid>
           <!-- <mod1:type>BVOIP</mod1:type>-->
            <mod3:isBundle>true</mod3:isBundle>
            <mod3:subOrders>
               <mod3:item>
                  <mod1:eid>
                     <mod2:context>OCX</mod2:context>
                     <mod2:id>{$sgId$}</mod2:id>
                     <mod2:entityType>Order</mod2:entityType>
                  </mod1:eid>
                  <mod1:type>DECOMPOSE</mod1:type>
                  <mod1:characteristics>
                     <mod2:item>
                        <mod2:name>ServiceGroupOrderId</mod2:name>
                        <mod2:value>{$sgId$}</mod2:value>
                     </mod2:item>
                      <mod2:item>
                <mod2:name>projectId</mod2:name>
                <mod2:value>{$projId$}</mod2:value>
              </mod2:item>
                  </mod1:characteristics>
                  <mod1:associations>
                     <mod2:item>
                        <mod2:associationName>AssociatedServiceOrder</mod2:associationName>
                        <mod2:items>
                           <mod2:item>
                              <mod2:context>OCX</mod2:context>
                              <mod2:id>{$oaIdAc$}</mod2:id>
                              <mod2:entityType>OrderAction</mod2:entityType>
                              <mod2:type>ACSM</mod2:type>
                              <!--<mod2:product>ACSM</mod2:product>-->
                           </mod2:item>
                        </mod2:items>
                     </mod2:item>
                     <mod2:item>
                        <mod2:associationName>AssociatedServiceOrder</mod2:associationName>
                        <mod2:items>
                           <mod2:item>
                              <mod2:context>OCX</mod2:context>
                              <mod2:id>{$oaId$}</mod2:id>
                              <mod2:entityType>OrderAction</mod2:entityType>
                              <mod2:type>MISM</mod2:type>
                           </mod2:item>
                        </mod2:items>
                     </mod2:item>
                  </mod1:associations>
                  <mod3:isBundle>false</mod3:isBundle>
                  <mod3:actionType>PR</mod3:actionType>
                  <mod3:actionSubType>NA</mod3:actionSubType>
                  <mod3:version>1</mod3:version>
                  <!--<mod3:DueDate>2015-10-04T18:13:51.0</mod3:DueDate> -->
               </mod3:item>
            </mod3:subOrders>
         </mod:order>
      </mod:manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>